app/commons/test_integration/providers/cassettes/TestStripeClient.test_create_payment_method[external].yaml

interactions:
- request:
    body: email=hahn%40doordash.com&description=Hello%21
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Connection:
      - keep-alive
      Content-Length:
      - '46'
      Content-Type:
      - application/x-www-form-urlencoded
      Idempotency-Key:
      - f518c4c1-a91b-44ef-9c27-9c4d4adaa215
      Stripe-Version:
      - '2019-09-09'
      User-Agent:
      - Stripe/v1 PythonBindings/2.32.1
      X-Stripe-Client-User-Agent:
      - '{"bindings_version": "2.32.1", "lang": "python", "publisher": "stripe", "httplib":
        "requests", "lang_version": "3.7.4", "platform": "Darwin-18.7.0-x86_64-i386-64bit",
        "uname": "Darwin MBP-0245 18.7.0 Darwin Kernel Version 18.7.0: Tue Aug 20
        16:57:14 PDT 2019; root:xnu-4903.271.2~2/RELEASE_X86_64 x86_64 i386"}'
      authorization:
      - DUMMY
    method: POST
    uri: https://api.stripe.com/v1/customers
  response:
    body:
      string: "{\n  \"id\": \"cus_Fv7YglldYsL2bq\",\n  \"object\": \"customer\",\n\
        \  \"account_balance\": 0,\n  \"address\": null,\n  \"balance\": 0,\n  \"\
        created\": 1570059151,\n  \"currency\": null,\n  \"default_source\": null,\n\
        \  \"delinquent\": false,\n  \"description\": \"Hello!\",\n  \"discount\"\
        : null,\n  \"email\": \"hahn@doordash.com\",\n  \"invoice_prefix\": \"3E79CE47\"\
        ,\n  \"invoice_settings\": {\n    \"custom_fields\": null,\n    \"default_payment_method\"\
        : null,\n    \"footer\": null\n  },\n  \"livemode\": false,\n  \"metadata\"\
        : {\n  },\n  \"name\": null,\n  \"phone\": null,\n  \"preferred_locales\"\
        : [\n\n  ],\n  \"shipping\": null,\n  \"sources\": {\n    \"object\": \"list\"\
        ,\n    \"data\": [\n\n    ],\n    \"has_more\": false,\n    \"total_count\"\
        : 0,\n    \"url\": \"/v1/customers/cus_Fv7YglldYsL2bq/sources\"\n  },\n  \"\
        subscriptions\": {\n    \"object\": \"list\",\n    \"data\": [\n\n    ],\n\
        \    \"has_more\": false,\n    \"total_count\": 0,\n    \"url\": \"/v1/customers/cus_Fv7YglldYsL2bq/subscriptions\"\
        \n  },\n  \"tax_exempt\": \"none\",\n  \"tax_ids\": {\n    \"object\": \"\
        list\",\n    \"data\": [\n\n    ],\n    \"has_more\": false,\n    \"total_count\"\
        : 0,\n    \"url\": \"/v1/customers/cus_Fv7YglldYsL2bq/tax_ids\"\n  },\n  \"\
        tax_info\": null,\n  \"tax_info_verification\": null\n}\n"
    headers:
      Connection:
      - keep-alive
      Content-Length:
      - '1136'
      Content-Type:
      - application/json
      Date:
      - Wed, 02 Oct 2019 23:32:31 GMT
      Server:
      - nginx
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
      access-control-allow-credentials:
      - 'true'
      access-control-allow-methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      access-control-allow-origin:
      - '*'
      access-control-expose-headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      access-control-max-age:
      - '300'
      cache-control:
      - no-cache, no-store
      idempotency-key:
      - f518c4c1-a91b-44ef-9c27-9c4d4adaa215
      original-request:
      - req_D4Adgn53YQOYbj
      request-id:
      - req_D4Adgn53YQOYbj
      stripe-should-retry:
      - 'false'
      stripe-version:
      - '2019-09-09'
    status:
      code: 200
      message: OK
- request:
    body: customer=cus_Fv7YglldYsL2bq
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Connection:
      - keep-alive
      Content-Length:
      - '27'
      Content-Type:
      - application/x-www-form-urlencoded
      Idempotency-Key:
      - 6ed72d51-71d3-42f9-bcbd-ea7d6c82586b
      Stripe-Version:
      - '2019-09-09'
      User-Agent:
      - Stripe/v1 PythonBindings/2.32.1
      X-Stripe-Client-Telemetry:
      - '{"last_request_metrics": {"request_id": "req_D4Adgn53YQOYbj", "request_duration_ms":
        555}}'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version": "2.32.1", "lang": "python", "publisher": "stripe", "httplib":
        "requests", "lang_version": "3.7.4", "platform": "Darwin-18.7.0-x86_64-i386-64bit",
        "uname": "Darwin MBP-0245 18.7.0 Darwin Kernel Version 18.7.0: Tue Aug 20
        16:57:14 PDT 2019; root:xnu-4903.271.2~2/RELEASE_X86_64 x86_64 i386"}'
      authorization:
      - DUMMY
    method: POST
    uri: https://api.stripe.com/v1/payment_methods/pm_card_visa/attach
  response:
    body:
      string: "{\n  \"id\": \"pm_0FPHJ5rw8hWoEwIJ8M4I2c42\",\n  \"object\": \"payment_method\"\
        ,\n  \"billing_details\": {\n    \"address\": {\n      \"city\": null,\n \
        \     \"country\": null,\n      \"line1\": null,\n      \"line2\": null,\n\
        \      \"postal_code\": null,\n      \"state\": null\n    },\n    \"email\"\
        : null,\n    \"name\": null,\n    \"phone\": null\n  },\n  \"card\": {\n \
        \   \"brand\": \"visa\",\n    \"checks\": {\n      \"address_line1_check\"\
        : null,\n      \"address_postal_code_check\": null,\n      \"cvc_check\":\
        \ null\n    },\n    \"country\": \"US\",\n    \"description\": \"Visa Classic\"\
        ,\n    \"exp_month\": 10,\n    \"exp_year\": 2020,\n    \"fingerprint\": \"\
        rca24boD2K4iFl6k\",\n    \"funding\": \"credit\",\n    \"generated_from\"\
        : null,\n    \"iin\": \"424242\",\n    \"issuer\": \"Stripe Payments UK Limited\"\
        ,\n    \"last4\": \"4242\",\n    \"three_d_secure_usage\": {\n      \"supported\"\
        : true\n    },\n    \"wallet\": null\n  },\n  \"created\": 1570059152,\n \
        \ \"customer\": \"cus_Fv7YglldYsL2bq\",\n  \"livemode\": false,\n  \"metadata\"\
        : {\n  },\n  \"type\": \"card\"\n}\n"
    headers:
      Connection:
      - keep-alive
      Content-Length:
      - '950'
      Content-Type:
      - application/json
      Date:
      - Wed, 02 Oct 2019 23:32:32 GMT
      Server:
      - nginx
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
      access-control-allow-credentials:
      - 'true'
      access-control-allow-methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      access-control-allow-origin:
      - '*'
      access-control-expose-headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      access-control-max-age:
      - '300'
      cache-control:
      - no-cache, no-store
      idempotency-key:
      - 6ed72d51-71d3-42f9-bcbd-ea7d6c82586b
      original-request:
      - req_1Hem0DbVJASDz0
      request-id:
      - req_1Hem0DbVJASDz0
      stripe-should-retry:
      - 'false'
      stripe-version:
      - '2019-09-09'
    status:
      code: 200
      message: OK
version: 1
